Revit 2026 API

# WorksetPreviewUniqueId Property

---

UniqueId of the workset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Guid UniqueId { get; }
```
```vb
Public ReadOnly Property UniqueId As Guid
	Get
```
```cpp
public:
property Guid UniqueId {
	Guid get ();
}
```
```fsharp
member UniqueId : Guid with get
```

#### Property Value

Guid

Stable identifier for a workset, UniqueId will not change while synchronizing with central.

#### Reference

WorksetPreview Class

Autodesk.Revit.DB Namespace